using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Flovers_WPF
{
    class Задачи
    {
        /*
         * ВЕЗДЕ СДЕЛАТЬ ПОИСК С ПОМОЩЬЮ ПОИСКОВОЙ СТРОКИ И ПЕРЕДЕЛАТЬ МЕТОДЫ ОБНОВЛЕНИЯ
         * 
         * ИСПРАВИТЬ НАЖАТИЕ НА КРЕСТИК ПРИ ВЫБОРЕ БД
         * 
         * New_Order_Window
         * {
         *      Отображение клиентов
         *      {
         *          + Выделение клиента
         *          + Снятие выделения с клиента
         *      }
         *      
         *      Отображение букетов
         *      {
         *          + Выделение букета
         *          + Снятие выделения с букета
         *      }
         *      
         *      Отображение корзины
         *      {
         *          + Проверка наличия на складе достаточного количества компонентов для букета перед добавлением в корзину.
         *          + Выделение компонента корзины
         *          + Снятие выделения с компонента корзины
         *          + Подсчёт стоимости каждой записи букета * количество букетов
         *          + Подсчёт стоимости всей корзины и вывод в label
         *      }
         *      
         *      Завершение заказа
         *      {
         !          + Вычитание компонентов, необходимых для букета со склада.
         *          + Запись в таблицу Carts всей корзины
         *          + Запись в таблицу Orders заказа
         *          + Связь Заказа и каждого компонента корзины
         *          

         *      }
         *      
         * }
         * 
         * Order_Window
         * {
         *      + Отображение заказов
         *      + Отображение корзины выделенного заказа
         *      + Реферальная система
         *      
         !      СДЕЛАТЬ ОКНО ДЛЯ ОПЛАТЫ ЗАКАЗА
         *      {
         *          - При изменении статуса заказа на "Оплачено..." Администратор должен заполнить поля с количеством баллов и денежной суммой к оплате. 
         *          - Количество баллов должно быть ограниченно количеством баллов клиента выбранного заказа.
         *      }
         * }
         */
    }
}
