using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Flovers_WPF
{
    class Задачи
    {
        /*
         ! ОКНО ОПЛАТЫ ЗАКАЗА!
         * 
         * Везде сделать поиск с помощью поисковой строки и переделать методы обновления ( Сделал, может-быть ещё где-нибудь будет нужно ).
         * 
         * Create_Flower_Window
         * {
         *      + Поиск букета по названию
         *      + Поиск компонента по названию
         * }
         * 
         * Components_Window
         * {
         *      + Поиск компонента по названию
         * }
         * 
         * New_Order_Window
         * {
         *      Отображение клиентов
         *      {
         *          + Выделение клиента
         *          + Снятие выделения с клиента
         *          + Поиск клиента по ФИО
         *      }
         *      
         *      Отображение букетов
         *      {
         *          + Выделение букета
         *          + Снятие выделения с букета
         *          + Поиск букета по Названию
         *      }
         *      
         *      Отображение корзины
         *      {
         *          + Проверка наличия на складе достаточного количества компонентов для букета перед добавлением в корзину.
         *          + Выделение компонента корзины
         *          + Снятие выделения с компонента корзины
         *          + Подсчёт стоимости каждой записи букета * количество букетов
         *          + Подсчёт стоимости всей корзины и вывод в label
         *          + Поиск букета по Названию
         *      }
         *      
         *      Завершение заказа
         *      {
         *          + Вычитание компонентов, необходимых для букета со склада.
         *          + Запись в таблицу Carts всей корзины
         *          + Запись в таблицу Orders заказа
         *          + Связь Заказа и каждого компонента корзины
         *      }
         *      
         * }
         * 
         * Order_Window
         * {
         *      + Отображение заказов
         *      + Отображение корзины выделенного заказа
         *      + Реферальная система
         *      
         !      СДЕЛАТЬ ОКНО ДЛЯ ОПЛАТЫ ЗАКАЗА
         *      {
         *          - При изменении статуса заказа на "Оплачено..." Администратор должен заполнить поля с количеством баллов и денежной суммой к оплате. 
         *          - Количество баллов должно быть ограниченно количеством баллов клиента выбранного заказа.
         *      }
         * }
         * 
         * Constants_Window
         * {
         *      + Отображение констант
         *      + CRUD операции
         *      + Перманентное наличие в БД записи Address и PhoneNumber
         * }
         */
    }
}
